###################################################################

# Created by write_sdc on Sun May 31 03:10:25 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_fanout 32 [current_design]
set_max_transition 1.5 [current_design]
set_max_area 0
set_load -pin_load 5 [get_ports {HRDATA[31]}]
set_load -pin_load 5 [get_ports {HRDATA[30]}]
set_load -pin_load 5 [get_ports {HRDATA[29]}]
set_load -pin_load 5 [get_ports {HRDATA[28]}]
set_load -pin_load 5 [get_ports {HRDATA[27]}]
set_load -pin_load 5 [get_ports {HRDATA[26]}]
set_load -pin_load 5 [get_ports {HRDATA[25]}]
set_load -pin_load 5 [get_ports {HRDATA[24]}]
set_load -pin_load 5 [get_ports {HRDATA[23]}]
set_load -pin_load 5 [get_ports {HRDATA[22]}]
set_load -pin_load 5 [get_ports {HRDATA[21]}]
set_load -pin_load 5 [get_ports {HRDATA[20]}]
set_load -pin_load 5 [get_ports {HRDATA[19]}]
set_load -pin_load 5 [get_ports {HRDATA[18]}]
set_load -pin_load 5 [get_ports {HRDATA[17]}]
set_load -pin_load 5 [get_ports {HRDATA[16]}]
set_load -pin_load 5 [get_ports {HRDATA[15]}]
set_load -pin_load 5 [get_ports {HRDATA[14]}]
set_load -pin_load 5 [get_ports {HRDATA[13]}]
set_load -pin_load 5 [get_ports {HRDATA[12]}]
set_load -pin_load 5 [get_ports {HRDATA[11]}]
set_load -pin_load 5 [get_ports {HRDATA[10]}]
set_load -pin_load 5 [get_ports {HRDATA[9]}]
set_load -pin_load 5 [get_ports {HRDATA[8]}]
set_load -pin_load 5 [get_ports {HRDATA[7]}]
set_load -pin_load 5 [get_ports {HRDATA[6]}]
set_load -pin_load 5 [get_ports {HRDATA[5]}]
set_load -pin_load 5 [get_ports {HRDATA[4]}]
set_load -pin_load 5 [get_ports {HRDATA[3]}]
set_load -pin_load 5 [get_ports {HRDATA[2]}]
set_load -pin_load 5 [get_ports {HRDATA[1]}]
set_load -pin_load 5 [get_ports {HRDATA[0]}]
set_load -pin_load 5 [get_ports HREADYOUT]
set_load -pin_load 5 [get_ports {HRESP[1]}]
set_load -pin_load 5 [get_ports {HRESP[0]}]
set_load -pin_load 5 [get_ports {HSPLIT[15]}]
set_load -pin_load 5 [get_ports {HSPLIT[14]}]
set_load -pin_load 5 [get_ports {HSPLIT[13]}]
set_load -pin_load 5 [get_ports {HSPLIT[12]}]
set_load -pin_load 5 [get_ports {HSPLIT[11]}]
set_load -pin_load 5 [get_ports {HSPLIT[10]}]
set_load -pin_load 5 [get_ports {HSPLIT[9]}]
set_load -pin_load 5 [get_ports {HSPLIT[8]}]
set_load -pin_load 5 [get_ports {HSPLIT[7]}]
set_load -pin_load 5 [get_ports {HSPLIT[6]}]
set_load -pin_load 5 [get_ports {HSPLIT[5]}]
set_load -pin_load 5 [get_ports {HSPLIT[4]}]
set_load -pin_load 5 [get_ports {HSPLIT[3]}]
set_load -pin_load 5 [get_ports {HSPLIT[2]}]
set_load -pin_load 5 [get_ports {HSPLIT[1]}]
set_load -pin_load 5 [get_ports {HSPLIT[0]}]
set_load -pin_load 5 [get_ports spi_cs_n]
set_load -pin_load 5 [get_ports spi_clk]
set_load -pin_load 5 [get_ports spi_mosi]
create_clock [get_ports HCLK]  -period 20  -waveform {0 10}
set_clock_uncertainty -setup 0.5  [get_clocks HCLK]
set_clock_uncertainty -hold 0.1  [get_clocks HCLK]
set_clock_transition -max -rise 0.2 [get_clocks HCLK]
set_clock_transition -max -fall 0.2 [get_clocks HCLK]
set_clock_transition -min -rise 0.2 [get_clocks HCLK]
set_clock_transition -min -fall 0.2 [get_clocks HCLK]
set_input_delay -clock HCLK  -max 8  [get_ports HSEL]
set_input_delay -clock HCLK  -min 1  [get_ports HSEL]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[31]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[31]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[30]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[30]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[29]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[29]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[28]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[28]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[27]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[27]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[26]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[26]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[25]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[25]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[24]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[24]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[23]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[23]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[22]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[22]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[21]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[21]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[20]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[20]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[19]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[19]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[18]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[18]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[17]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[17]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[16]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[16]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[15]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[15]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[14]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[14]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[13]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[13]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[12]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[12]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[11]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[11]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[10]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[10]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[9]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[9]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[8]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[8]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[7]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[7]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[6]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[6]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[5]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[5]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[4]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[4]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[3]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[3]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[2]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[2]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[1]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[1]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HADDR[0]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HADDR[0]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HTRANS[1]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HTRANS[1]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HTRANS[0]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HTRANS[0]}]
set_input_delay -clock HCLK  -max 8  [get_ports HWRITE]
set_input_delay -clock HCLK  -min 1  [get_ports HWRITE]
set_input_delay -clock HCLK  -max 8  [get_ports {HSIZE[2]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HSIZE[2]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HSIZE[1]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HSIZE[1]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HSIZE[0]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HSIZE[0]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HBURST[2]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HBURST[2]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HBURST[1]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HBURST[1]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HBURST[0]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HBURST[0]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HPROT[3]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HPROT[3]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HPROT[2]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HPROT[2]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HPROT[1]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HPROT[1]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HPROT[0]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HPROT[0]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HMASTER[3]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HMASTER[3]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HMASTER[2]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HMASTER[2]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HMASTER[1]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HMASTER[1]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HMASTER[0]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HMASTER[0]}]
set_input_delay -clock HCLK  -max 8  [get_ports HMASTLOCK]
set_input_delay -clock HCLK  -min 1  [get_ports HMASTLOCK]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[31]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[31]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[30]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[30]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[29]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[29]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[28]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[28]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[27]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[27]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[26]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[26]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[25]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[25]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[24]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[24]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[23]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[23]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[22]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[22]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[21]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[21]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[20]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[20]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[19]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[19]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[18]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[18]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[17]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[17]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[16]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[16]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[15]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[15]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[14]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[14]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[13]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[13]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[12]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[12]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[11]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[11]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[10]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[10]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[9]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[9]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[8]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[8]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[7]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[7]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[6]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[6]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[5]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[5]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[4]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[4]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[3]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[3]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[2]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[2]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[1]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[1]}]
set_input_delay -clock HCLK  -max 8  [get_ports {HWDATA[0]}]
set_input_delay -clock HCLK  -min 1  [get_ports {HWDATA[0]}]
set_input_delay -clock HCLK  -max 8  [get_ports HREADY]
set_input_delay -clock HCLK  -min 1  [get_ports HREADY]
set_input_delay -clock HCLK  -max 8  [get_ports spi_miso]
set_input_delay -clock HCLK  -min 1  [get_ports spi_miso]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[31]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[31]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[30]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[30]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[29]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[29]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[28]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[28]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[27]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[27]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[26]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[26]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[25]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[25]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[24]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[24]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[23]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[23]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[22]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[22]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[21]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[21]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[20]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[20]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[19]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[19]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[18]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[18]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[17]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[17]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[16]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[16]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[15]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[15]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[14]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[14]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[13]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[13]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[12]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[12]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[11]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[11]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[10]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[10]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[9]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[9]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[8]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[8]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[7]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[7]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[6]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[6]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[5]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[5]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[4]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[4]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[3]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[3]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[2]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[2]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[1]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[1]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRDATA[0]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRDATA[0]}]
set_output_delay -clock HCLK  -max 8  [get_ports HREADYOUT]
set_output_delay -clock HCLK  -min 1  [get_ports HREADYOUT]
set_output_delay -clock HCLK  -max 8  [get_ports {HRESP[1]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRESP[1]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HRESP[0]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HRESP[0]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[15]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[15]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[14]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[14]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[13]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[13]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[12]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[12]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[11]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[11]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[10]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[10]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[9]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[9]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[8]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[8]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[7]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[7]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[6]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[6]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[5]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[5]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[4]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[4]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[3]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[3]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[2]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[2]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[1]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[1]}]
set_output_delay -clock HCLK  -max 8  [get_ports {HSPLIT[0]}]
set_output_delay -clock HCLK  -min 1  [get_ports {HSPLIT[0]}]
set_output_delay -clock HCLK  -max 8  [get_ports spi_clk]
set_output_delay -clock HCLK  -min 1  [get_ports spi_clk]
set_output_delay -clock HCLK  -max 8  [get_ports spi_cs_n]
set_output_delay -clock HCLK  -min 1  [get_ports spi_cs_n]
set_output_delay -clock HCLK  -max 8  [get_ports spi_mosi]
set_output_delay -clock HCLK  -min 1  [get_ports spi_mosi]
set_input_transition -max 0.2  [get_ports HRESETn]
set_input_transition -min 0.2  [get_ports HRESETn]
set_input_transition -max 0.2  [get_ports HSEL]
set_input_transition -min 0.2  [get_ports HSEL]
set_input_transition -max 0.2  [get_ports {HADDR[31]}]
set_input_transition -min 0.2  [get_ports {HADDR[31]}]
set_input_transition -max 0.2  [get_ports {HADDR[30]}]
set_input_transition -min 0.2  [get_ports {HADDR[30]}]
set_input_transition -max 0.2  [get_ports {HADDR[29]}]
set_input_transition -min 0.2  [get_ports {HADDR[29]}]
set_input_transition -max 0.2  [get_ports {HADDR[28]}]
set_input_transition -min 0.2  [get_ports {HADDR[28]}]
set_input_transition -max 0.2  [get_ports {HADDR[27]}]
set_input_transition -min 0.2  [get_ports {HADDR[27]}]
set_input_transition -max 0.2  [get_ports {HADDR[26]}]
set_input_transition -min 0.2  [get_ports {HADDR[26]}]
set_input_transition -max 0.2  [get_ports {HADDR[25]}]
set_input_transition -min 0.2  [get_ports {HADDR[25]}]
set_input_transition -max 0.2  [get_ports {HADDR[24]}]
set_input_transition -min 0.2  [get_ports {HADDR[24]}]
set_input_transition -max 0.2  [get_ports {HADDR[23]}]
set_input_transition -min 0.2  [get_ports {HADDR[23]}]
set_input_transition -max 0.2  [get_ports {HADDR[22]}]
set_input_transition -min 0.2  [get_ports {HADDR[22]}]
set_input_transition -max 0.2  [get_ports {HADDR[21]}]
set_input_transition -min 0.2  [get_ports {HADDR[21]}]
set_input_transition -max 0.2  [get_ports {HADDR[20]}]
set_input_transition -min 0.2  [get_ports {HADDR[20]}]
set_input_transition -max 0.2  [get_ports {HADDR[19]}]
set_input_transition -min 0.2  [get_ports {HADDR[19]}]
set_input_transition -max 0.2  [get_ports {HADDR[18]}]
set_input_transition -min 0.2  [get_ports {HADDR[18]}]
set_input_transition -max 0.2  [get_ports {HADDR[17]}]
set_input_transition -min 0.2  [get_ports {HADDR[17]}]
set_input_transition -max 0.2  [get_ports {HADDR[16]}]
set_input_transition -min 0.2  [get_ports {HADDR[16]}]
set_input_transition -max 0.2  [get_ports {HADDR[15]}]
set_input_transition -min 0.2  [get_ports {HADDR[15]}]
set_input_transition -max 0.2  [get_ports {HADDR[14]}]
set_input_transition -min 0.2  [get_ports {HADDR[14]}]
set_input_transition -max 0.2  [get_ports {HADDR[13]}]
set_input_transition -min 0.2  [get_ports {HADDR[13]}]
set_input_transition -max 0.2  [get_ports {HADDR[12]}]
set_input_transition -min 0.2  [get_ports {HADDR[12]}]
set_input_transition -max 0.2  [get_ports {HADDR[11]}]
set_input_transition -min 0.2  [get_ports {HADDR[11]}]
set_input_transition -max 0.2  [get_ports {HADDR[10]}]
set_input_transition -min 0.2  [get_ports {HADDR[10]}]
set_input_transition -max 0.2  [get_ports {HADDR[9]}]
set_input_transition -min 0.2  [get_ports {HADDR[9]}]
set_input_transition -max 0.2  [get_ports {HADDR[8]}]
set_input_transition -min 0.2  [get_ports {HADDR[8]}]
set_input_transition -max 0.2  [get_ports {HADDR[7]}]
set_input_transition -min 0.2  [get_ports {HADDR[7]}]
set_input_transition -max 0.2  [get_ports {HADDR[6]}]
set_input_transition -min 0.2  [get_ports {HADDR[6]}]
set_input_transition -max 0.2  [get_ports {HADDR[5]}]
set_input_transition -min 0.2  [get_ports {HADDR[5]}]
set_input_transition -max 0.2  [get_ports {HADDR[4]}]
set_input_transition -min 0.2  [get_ports {HADDR[4]}]
set_input_transition -max 0.2  [get_ports {HADDR[3]}]
set_input_transition -min 0.2  [get_ports {HADDR[3]}]
set_input_transition -max 0.2  [get_ports {HADDR[2]}]
set_input_transition -min 0.2  [get_ports {HADDR[2]}]
set_input_transition -max 0.2  [get_ports {HADDR[1]}]
set_input_transition -min 0.2  [get_ports {HADDR[1]}]
set_input_transition -max 0.2  [get_ports {HADDR[0]}]
set_input_transition -min 0.2  [get_ports {HADDR[0]}]
set_input_transition -max 0.2  [get_ports {HTRANS[1]}]
set_input_transition -min 0.2  [get_ports {HTRANS[1]}]
set_input_transition -max 0.2  [get_ports {HTRANS[0]}]
set_input_transition -min 0.2  [get_ports {HTRANS[0]}]
set_input_transition -max 0.2  [get_ports HWRITE]
set_input_transition -min 0.2  [get_ports HWRITE]
set_input_transition -max 0.2  [get_ports {HSIZE[2]}]
set_input_transition -min 0.2  [get_ports {HSIZE[2]}]
set_input_transition -max 0.2  [get_ports {HSIZE[1]}]
set_input_transition -min 0.2  [get_ports {HSIZE[1]}]
set_input_transition -max 0.2  [get_ports {HSIZE[0]}]
set_input_transition -min 0.2  [get_ports {HSIZE[0]}]
set_input_transition -max 0.2  [get_ports {HBURST[2]}]
set_input_transition -min 0.2  [get_ports {HBURST[2]}]
set_input_transition -max 0.2  [get_ports {HBURST[1]}]
set_input_transition -min 0.2  [get_ports {HBURST[1]}]
set_input_transition -max 0.2  [get_ports {HBURST[0]}]
set_input_transition -min 0.2  [get_ports {HBURST[0]}]
set_input_transition -max 0.2  [get_ports {HPROT[3]}]
set_input_transition -min 0.2  [get_ports {HPROT[3]}]
set_input_transition -max 0.2  [get_ports {HPROT[2]}]
set_input_transition -min 0.2  [get_ports {HPROT[2]}]
set_input_transition -max 0.2  [get_ports {HPROT[1]}]
set_input_transition -min 0.2  [get_ports {HPROT[1]}]
set_input_transition -max 0.2  [get_ports {HPROT[0]}]
set_input_transition -min 0.2  [get_ports {HPROT[0]}]
set_input_transition -max 0.2  [get_ports {HMASTER[3]}]
set_input_transition -min 0.2  [get_ports {HMASTER[3]}]
set_input_transition -max 0.2  [get_ports {HMASTER[2]}]
set_input_transition -min 0.2  [get_ports {HMASTER[2]}]
set_input_transition -max 0.2  [get_ports {HMASTER[1]}]
set_input_transition -min 0.2  [get_ports {HMASTER[1]}]
set_input_transition -max 0.2  [get_ports {HMASTER[0]}]
set_input_transition -min 0.2  [get_ports {HMASTER[0]}]
set_input_transition -max 0.2  [get_ports HMASTLOCK]
set_input_transition -min 0.2  [get_ports HMASTLOCK]
set_input_transition -max 0.2  [get_ports {HWDATA[31]}]
set_input_transition -min 0.2  [get_ports {HWDATA[31]}]
set_input_transition -max 0.2  [get_ports {HWDATA[30]}]
set_input_transition -min 0.2  [get_ports {HWDATA[30]}]
set_input_transition -max 0.2  [get_ports {HWDATA[29]}]
set_input_transition -min 0.2  [get_ports {HWDATA[29]}]
set_input_transition -max 0.2  [get_ports {HWDATA[28]}]
set_input_transition -min 0.2  [get_ports {HWDATA[28]}]
set_input_transition -max 0.2  [get_ports {HWDATA[27]}]
set_input_transition -min 0.2  [get_ports {HWDATA[27]}]
set_input_transition -max 0.2  [get_ports {HWDATA[26]}]
set_input_transition -min 0.2  [get_ports {HWDATA[26]}]
set_input_transition -max 0.2  [get_ports {HWDATA[25]}]
set_input_transition -min 0.2  [get_ports {HWDATA[25]}]
set_input_transition -max 0.2  [get_ports {HWDATA[24]}]
set_input_transition -min 0.2  [get_ports {HWDATA[24]}]
set_input_transition -max 0.2  [get_ports {HWDATA[23]}]
set_input_transition -min 0.2  [get_ports {HWDATA[23]}]
set_input_transition -max 0.2  [get_ports {HWDATA[22]}]
set_input_transition -min 0.2  [get_ports {HWDATA[22]}]
set_input_transition -max 0.2  [get_ports {HWDATA[21]}]
set_input_transition -min 0.2  [get_ports {HWDATA[21]}]
set_input_transition -max 0.2  [get_ports {HWDATA[20]}]
set_input_transition -min 0.2  [get_ports {HWDATA[20]}]
set_input_transition -max 0.2  [get_ports {HWDATA[19]}]
set_input_transition -min 0.2  [get_ports {HWDATA[19]}]
set_input_transition -max 0.2  [get_ports {HWDATA[18]}]
set_input_transition -min 0.2  [get_ports {HWDATA[18]}]
set_input_transition -max 0.2  [get_ports {HWDATA[17]}]
set_input_transition -min 0.2  [get_ports {HWDATA[17]}]
set_input_transition -max 0.2  [get_ports {HWDATA[16]}]
set_input_transition -min 0.2  [get_ports {HWDATA[16]}]
set_input_transition -max 0.2  [get_ports {HWDATA[15]}]
set_input_transition -min 0.2  [get_ports {HWDATA[15]}]
set_input_transition -max 0.2  [get_ports {HWDATA[14]}]
set_input_transition -min 0.2  [get_ports {HWDATA[14]}]
set_input_transition -max 0.2  [get_ports {HWDATA[13]}]
set_input_transition -min 0.2  [get_ports {HWDATA[13]}]
set_input_transition -max 0.2  [get_ports {HWDATA[12]}]
set_input_transition -min 0.2  [get_ports {HWDATA[12]}]
set_input_transition -max 0.2  [get_ports {HWDATA[11]}]
set_input_transition -min 0.2  [get_ports {HWDATA[11]}]
set_input_transition -max 0.2  [get_ports {HWDATA[10]}]
set_input_transition -min 0.2  [get_ports {HWDATA[10]}]
set_input_transition -max 0.2  [get_ports {HWDATA[9]}]
set_input_transition -min 0.2  [get_ports {HWDATA[9]}]
set_input_transition -max 0.2  [get_ports {HWDATA[8]}]
set_input_transition -min 0.2  [get_ports {HWDATA[8]}]
set_input_transition -max 0.2  [get_ports {HWDATA[7]}]
set_input_transition -min 0.2  [get_ports {HWDATA[7]}]
set_input_transition -max 0.2  [get_ports {HWDATA[6]}]
set_input_transition -min 0.2  [get_ports {HWDATA[6]}]
set_input_transition -max 0.2  [get_ports {HWDATA[5]}]
set_input_transition -min 0.2  [get_ports {HWDATA[5]}]
set_input_transition -max 0.2  [get_ports {HWDATA[4]}]
set_input_transition -min 0.2  [get_ports {HWDATA[4]}]
set_input_transition -max 0.2  [get_ports {HWDATA[3]}]
set_input_transition -min 0.2  [get_ports {HWDATA[3]}]
set_input_transition -max 0.2  [get_ports {HWDATA[2]}]
set_input_transition -min 0.2  [get_ports {HWDATA[2]}]
set_input_transition -max 0.2  [get_ports {HWDATA[1]}]
set_input_transition -min 0.2  [get_ports {HWDATA[1]}]
set_input_transition -max 0.2  [get_ports {HWDATA[0]}]
set_input_transition -min 0.2  [get_ports {HWDATA[0]}]
set_input_transition -max 0.2  [get_ports HREADY]
set_input_transition -min 0.2  [get_ports HREADY]
set_input_transition -max 0.2  [get_ports spi_miso]
set_input_transition -min 0.2  [get_ports spi_miso]
set_false_path   -from [get_ports HRESETn]
set_false_path -hold   -from [list [get_cells u_spi_fsm/state_reg_2_] [get_cells                     \
u_spi_fsm/state_reg_1_] [get_cells u_spi_fsm/state_reg_0_]]
